# Скорость первого автомобиля Vi км/ч, второго — V2 км/ч, расстояние
# между ними S км. Определить расстояние между ними через T часов, если автомобили
# первоначально движутся навстречу друг другу. Данное расстояние равно модулю разности
# начального расстояния и общего пути, проделанного автомобилями; общий путь = время •
# суммарная скорость.

V1 = int(input("введите скорость 1 автомобиля - "))
V2 = int(input("ВВедите скорость 2 автомобиля - "))
S = int(input("Введитие начальное рассотяние - "))
T = int(input("Введите время - "))

sum_dist = T * (V1+V2)
put = abs(S - sum_dist)

print(f"В пути {T}ч")
print(f"осталось проехать -  {put}км")
